Revit 2027 API
MacroManager.Folder Property
 The modules folder.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Folder { get; }
Public ReadOnly Property Folder As String
	Get
public:
property String^ Folder {
	String^ get ();
}
member Folder : string with get
Property Value
String
See Also
Reference
MacroManager Class
Autodesk.Revit.DB.Macros Namespace